What is a Dataframe<br>
DataFrame is 2D array, with tabular data structre
IT is used to add label Its a dataframe with 2D structure<br>
It is created by combination of multiple series .<br>
In series label cannot be repeated  <br>
But inside the particular dataframe the index name can repeated<br><br>

How to create a dataframe ?

In [2]:
import pandas as pd

In [13]:
purchase_1 = pd.Series({'Name':'Chris',
                       'Item Purchased':'Dog food',
                        'Cost': 22.50
                       })

purchase_2 = pd.Series({'Name':'Kevyn',
                       'Item Purchased':'Kitty Litter',
                        'Cost': 2.50
                       })

purchase_3=pd.Series({'Name':'Vinod',
                       'Item Purchased':'Bird Seed',
                        'Cost': 5.0
                       })



df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['store1','store1','store2'])
df

         Name Item Purchased  Cost
store1  Chris       Dog food  22.5
store1  Kevyn   Kitty Litter   2.5
store2  Vinod      Bird Seed   5.0

In [14]:
df2=df.to_csv('store.csv') #write dataframe in to csv file

In [15]:
a=df.index
a

Index(['store1', 'store1', 'store2'], dtype='object')

In [17]:
df.loc['store2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: store2, dtype: object

In [22]:
type(df.loc['store2'])

pandas.core.series.Series

In [19]:
df["Name"]

store1    Chris
store1    Kevyn
store2    Vinod
Name: Name, dtype: object

In [20]:
type(df["Name"])

pandas.core.series.Series

In [16]:
df.loc['store1']

         Name Item Purchased  Cost
store1  Chris       Dog food  22.5
store1  Kevyn   Kitty Litter   2.5

In [21]:
type(df.loc['store1'])

pandas.core.frame.DataFrame

In [18]:
df.loc["store1",'Cost']

store1    22.5
store1     2.5
Name: Cost, dtype: float64

In [19]:
df.T

                  store1        store1     store2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [20]:
df

         Name Item Purchased  Cost
store1  Chris       Dog food  22.5
store1  Kevyn   Kitty Litter   2.5
store2  Vinod      Bird Seed   5.0

In [22]:
df.T.loc['Cost']

store1    22.5
store1     2.5
store2       5
Name: Cost, dtype: object

In [23]:
df.loc[:,["Name","Cost"]]

         Name  Cost
store1  Chris  22.5
store1  Kevyn   2.5
store2  Vinod   5.0

In [24]:
df.drop("store1") #until you assign it to df it is temperary

         Name Item Purchased  Cost
store2  Vinod      Bird Seed   5.0

In [25]:
df

         Name Item Purchased  Cost
store1  Chris       Dog food  22.5
store1  Kevyn   Kitty Litter   2.5
store2  Vinod      Bird Seed   5.0

In [28]:
df1=df.copy()
del df1["Name"]  #permanently removed

In [30]:
df1

       Item Purchased  Cost
store1       Dog food  22.5
store1   Kitty Litter   2.5
store2      Bird Seed   5.0

In [29]:
#df['location']=[1,2,3]
df['location']=None

In [28]:
df

         Name Item Purchased  Cost location
store1  Chris       Dog food  22.5     None
store1  Kevyn   Kitty Litter   2.5     None
store2  Vinod      Bird Seed   5.0     None

In [36]:
Costs=df["Cost"]
Costs

store1    30.5
store1    10.5
store2    13.0
Name: Cost, dtype: float64

In [37]:
Costs+=2
Costs

store1    32.5
store1    12.5
store2    15.0
Name: Cost, dtype: float64

In [38]:
df

         Name Item Purchased  Cost location
store1  Chris       Dog food  24.5     None
store1  Kevyn   Kitty Litter   4.5     None
store2  Vinod      Bird Seed   7.0     None

In [39]:
df.iloc[0:2,0:2]

         Name Item Purchased
store1  Chris       Dog food
store1  Kevyn   Kitty Litter